# 将列表转换成字典
# l1 = [1, 2, 3, 4]
# l2 = ['a', 'b', 'c', 'd']
# d = zip(l1, l2)
# print(dict(d))

names = [
    ["刘备", "56", "男", "106", "IBM", 500, "50"],
    ["大乔", "19", "女", "230", "微软", 501, "60"],
    ["小乔", "19", "女", "210", "Oracle", 600, "60"],
    ["张飞", "45", "男", "230", "Tencent", 700, "10"]
]
names1 = ["姓名", "年龄", "性别", "编号", "任职公司", "薪资", "部门编号"]
dic = {}
dic1 = {}
for i in range(0, len(names)):
    d = zip(names1[1:], names[i][1:])  # 将列表转换成字典
    dic1[names[i][0]] = dict(d)
    dic[names1[0]] = dic1
print(dic)
